app/Http/Controllers/FrontEndController.php

select * from `pages` where `showAsLink` = 1
---
                'features'=>$features,
                'availableLanguages'=>$availableLanguages,
                'locale'=>$locale,
                'pages'=>Pages::where('showAsLink', 1)->get(),