app/Http/Controllers/HomeController.php

select count(*) as aggregate from `orders` where `created_at` > '2022-04-21 15:51:15' and `orders`.`deleted_at` is null
select ROUND(SUM(order_price+delivery_price),2) as order_price, SUM(delivery_price + static_fee + fee_value) AS total_fee, SUM(delivery_price) AS total_delivery, SUM(static_fee) AS total_static_fee, SUM(fee_value) AS total_fee_value from `orders` where `created_at` > '2022-04-21 15:51:15' and `payment_status` = 'paid' and `orders`.`deleted_at` is null limit 1
select count(id) as totalPerMonth, ROUND(SUM(order_price + delivery_price),2) AS sumValue, MONTH(created_at) month from `orders` where `created_at` > '2021-11-01 00:00:00' and `payment_status` = 'paid' and `orders`.`deleted_at` is null group by YEAR(created_at), MONTH(created_at) order by YEAR(created_at), MONTH(created_at) asc
---
            12 => __('Dec'),
        ];

        $last30daysOrders = Order::where('created_at', '>', $last30days)->count();
        $last30daysOrdersValue = Order::where('created_at', '>', $last30days)
        ->where('payment_status','paid')
        ->select(DB::raw('ROUND(SUM(order_price+delivery_price),2) as order_price'),DB::raw('SUM(delivery_price + static_fee + fee_value) AS total_fee'),DB::raw('SUM(delivery_price) AS total_delivery'),DB::raw('SUM(static_fee) AS total_static_fee'),DB::raw('SUM(fee_value) AS total_fee_value'))
        ->first()->toArray();

        $sevenMonthsDate = Carbon::now()->subMonths(6)->startOfMonth();
        $salesValueRaw=Order::where('created_at', '>', $sevenMonthsDate)
                ->where('payment_status','paid')
                ->groupBy(DB::raw('YEAR(created_at), MONTH(created_at)'))
                ->orderBy(DB::raw('YEAR(created_at), MONTH(created_at)'), 'asc')
                ->select(DB::raw('count(id) as totalPerMonth'),DB::raw('ROUND(SUM(order_price + delivery_price),2) AS sumValue'),DB::raw('MONTH(created_at) month'))
                ->get()->toArray();